In [ ]:
#pandas
#1.Series : 1차원 Vector + 명시적 index
#2.DataFrame : 2차원 Matrix + 명시적 index

In [ ]:
# series

In [1]:
import numpy as np
import pandas as pd

In [6]:
L = [1,2,3,4] #index를 명시하지 않으면 0부터 자동으로 index가 생성.. 
pd.Series(L)

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
L = [1,2,3,4]
pd.Series(L,index=['a','b','c','d'])

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
L = {'a':1,'b':2,'c':3,'d':4} #dict의 경우 series로 만들면, key가 index가 된다..
pd.Series(L)

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
L = {'a':1,'b':2,'c':3,'d':4}
pd.Series(L,index=['가','나','다','라'])   #index 기준으로 처리

가   NaN
나   NaN
다   NaN
라   NaN
dtype: float64

In [15]:
L = {'a':1,'b':2,'c':3,'d':4}
S = pd.Series(L,index=['a','b','c','d','e','f','g'])

In [16]:
L['c']

3

In [19]:
S['g'] = 300
S

a      1.0
b      2.0
c      3.0
d      4.0
e      NaN
f      NaN
g    300.0
dtype: float64

In [20]:
S.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [21]:
S.values

array([  1.,   2.,   3.,   4.,  nan,  nan, 300.])

In [23]:
raw_data = {
    'first_name':['jason','molly','tina','jake','amy'],
    'last_name':['miller','jacobson','ali','milner','cooze'],
    'age':[12,14,45,63,34],
    'city':['Chicago','SF','LA','Boston','NY']
}

In [27]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age     city
0      jason    miller   12  Chicago
1      molly  jacobson   14       SF
2       tina       ali   45       LA
3       jake    milner   63   Boston
4        amy     cooze   34       NY

In [28]:
pd.DataFrame(raw_data, columns=['last_name','first_name'])

  last_name first_name
0    miller      jason
1  jacobson      molly
2       ali       tina
3    milner       jake
4     cooze        amy

In [30]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age     city
0      jason    miller   12  Chicago
1      molly  jacobson   14       SF
2       tina       ali   45       LA
3       jake    milner   63   Boston
4        amy     cooze   34       NY

In [31]:
df['first_name'] #column명으로 column 선택

0    jason
1    molly
2     tina
3     jake
4      amy
Name: first_name, dtype: object

In [37]:
df.index = ['a','b','c','d','e']
df

  first_name last_name  age     city
a      jason    miller   12  Chicago
b      molly  jacobson   14       SF
c       tina       ali   45       LA
d       jake    milner   63   Boston
e        amy     cooze   34       NY

In [38]:
df.loc['c'] #string name

first_name    tina
last_name      ali
age             45
city            LA
Name: c, dtype: object

In [39]:
df.iloc[2] #index #

first_name    tina
last_name      ali
age             45
city            LA
Name: c, dtype: object

In [ ]:
#df['칼럼명'] => 해당 칼럼을 출력
#df.loc['인덱스명'] => 해당 row를 선택
#df.iloc[row번호] => 해당 row 선택
#df.loc['인덱스명','칼럼명']
#df.iloc[인덱스번호,칼럼번호]

In [48]:
df.iloc[0,3]

'Chicago'

In [44]:
df.loc[['b','c']]

  first_name last_name  age city
b      molly  jacobson   14   SF
c       tina       ali   45   LA

In [45]:
df.iloc[[1,2]]

  first_name last_name  age city
b      molly  jacobson   14   SF
c       tina       ali   45   LA

In [49]:
df

  first_name last_name  age     city
a      jason    miller   12  Chicago
b      molly  jacobson   14       SF
c       tina       ali   45       LA
d       jake    milner   63   Boston
e        amy     cooze   34       NY

In [51]:
df.loc[['b','c','d'],['last_name','age']]

  last_name  age
b  jacobson   14
c       ali   45
d    milner   63

In [52]:
df.iloc[[1,2,3],[1,2]]

  last_name  age
b  jacobson   14
c       ali   45
d    milner   63

In [53]:
df

  first_name last_name  age     city
a      jason    miller   12  Chicago
b      molly  jacobson   14       SF
c       tina       ali   45       LA
d       jake    milner   63   Boston
e        amy     cooze   34       NY

In [60]:
df.iloc[0:2,0:3]

  first_name last_name  age
a      jason    miller   12
b      molly  jacobson   14

In [61]:
df.iloc[2:5,0:]

  first_name last_name  age    city
c       tina       ali   45      LA
d       jake    milner   63  Boston
e        amy     cooze   34      NY

In [62]:
df.loc['a':'e','age':'city']

   age     city
a   12  Chicago
b   14       SF
c   45       LA
d   63   Boston
e   34       NY

In [63]:
df

  first_name last_name  age     city
a      jason    miller   12  Chicago
b      molly  jacobson   14       SF
c       tina       ali   45       LA
d       jake    milner   63   Boston
e        amy     cooze   34       NY

In [65]:
df.loc['a':'b','last_name':'age']

  last_name  age
a    miller   12
b  jacobson   14

In [66]:
df.iloc[0:3:2,1:3]

  last_name  age
a    miller   12
c       ali   45

In [67]:
df.loc['b':'d','last_name':'city']

  last_name  age    city
b  jacobson   14      SF
c       ali   45      LA
d    milner   63  Boston

In [68]:
df.iloc[1:4,1:]

  last_name  age    city
b  jacobson   14      SF
c       ali   45      LA
d    milner   63  Boston

In [72]:
df.loc[['b','d'],'last_name':'city']

  last_name  age    city
b  jacobson   14      SF
d    milner   63  Boston

In [73]:
df

  first_name last_name  age     city
a      jason    miller   12  Chicago
b      molly  jacobson   14       SF
c       tina       ali   45       LA
d       jake    milner   63   Boston
e        amy     cooze   34       NY

In [74]:
df['age']

a    12
b    14
c    45
d    63
e    34
Name: age, dtype: int64

In [75]:
df['age'] > 30

a    False
b    False
c     True
d     True
e     True
Name: age, dtype: bool

In [77]:
df.loc[df['age'] > 30]

  first_name last_name  age    city
c       tina       ali   45      LA
d       jake    milner   63  Boston
e        amy     cooze   34      NY

In [82]:
df.loc['c','city']

'LA'

In [83]:
df.iloc[2,0:]

first_name    tina
last_name      ali
age             45
city            LA
Name: c, dtype: object

In [84]:
df.loc[df['city'] == 'LA']

  first_name last_name  age city
c       tina       ali   45   LA

In [88]:
df

  first_name last_name  age     city
a      jason    miller   12  Chicago
b      molly  jacobson   14       SF
c       tina       ali   45       LA
d       jake    milner   63   Boston
e        amy     cooze   34       NY

In [90]:
df.loc[df['age'] == 45]

  first_name last_name  age city
c       tina       ali   45   LA

In [91]:
df.last_name == 'ali' #boolean 사용할 경우

a    False
b    False
c     True
d    False
e    False
Name: last_name, dtype: bool

In [92]:
df[df.last_name == 'ali']

  first_name last_name  age city
c       tina       ali   45   LA

In [93]:
df[df.last_name == 'ali'].age

c    45
Name: age, dtype: int64

In [94]:
df.T #행과 열의 전환...

                  a         b     c       d      e
first_name    jason     molly  tina    jake    amy
last_name    miller  jacobson   ali  milner  cooze
age              12        14    45      63     34
city        Chicago        SF    LA  Boston     NY

In [95]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [96]:
df.columns

Index(['first_name', 'last_name', 'age', 'city'], dtype='object')

In [97]:
df.to_csv('test_df.csv')

In [98]:
pwd

'D:\\LJH_BIGDATA\\numpy'

In [102]:
df.head(2)

  first_name last_name  age     city
a      jason    miller   12  Chicago
b      molly  jacobson   14       SF

In [100]:
df.tail()

  first_name last_name  age     city
a      jason    miller   12  Chicago
b      molly  jacobson   14       SF
c       tina       ali   45       LA
d       jake    milner   63   Boston
e        amy     cooze   34       NY

In [144]:
del df['age']

In [145]:
df

  first_name last_name     city
a      jason    miller  Chicago
b      molly  jacobson       SF
c       tina       ali       LA
d       jake    milner   Boston
e        amy     cooze       NY

In [149]:
raw_data = {
    'first_name':['jason','molly','tina','jake','amy'],
    'last_name':['miller','jacobson','ali','milner','cooze'],
    'age':[12,14,45,63,34],
    'city':['Chicago','SF','LA','Boston','NY']
}

In [150]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age     city
0      jason    miller   12  Chicago
1      molly  jacobson   14       SF
2       tina       ali   45       LA
3       jake    milner   63   Boston
4        amy     cooze   34       NY

In [151]:
df.index = ['a','b','c','d','e']
df

  first_name last_name  age     city
a      jason    miller   12  Chicago
b      molly  jacobson   14       SF
c       tina       ali   45       LA
d       jake    milner   63   Boston
e        amy     cooze   34       NY

In [140]:
df.drop('a')

  first_name last_name  age    city
b      molly  jacobson   14      SF
c       tina       ali   45      LA
d       jake    milner   63  Boston
e        amy     cooze   34      NY

In [107]:
df.drop('city',axis=1) #df 기본 세팅 0 이기 떄문에 axis =1

  first_name last_name
a      jason    miller
b      molly  jacobson
c       tina       ali
d       jake    milner
e        amy     cooze

In [108]:
del df

In [109]:
df

NameError: name 'df' is not defined

In [111]:
df = pd.read_csv('test_df.csv')
df

  Unnamed: 0 first_name last_name  age     city
0          a      jason    miller   12  Chicago
1          b      molly  jacobson   14       SF
2          c       tina       ali   45       LA
3          d       jake    milner   63   Boston
4          e        amy     cooze   34       NY

In [ ]:
#apply

In [113]:
#age칼럼의 값을 한국나이로 전환.. => +1

In [115]:
kage = []
for a in df.age:
    kage.append(a+1)
kage

[13, 15, 46, 64, 35]

In [116]:
def kage(a):
    return a+1

In [117]:
df['age'].apply(kage)

0    13
1    15
2    46
3    64
4    35
Name: age, dtype: int64

In [118]:
df['age'].apply(lambda x:x+1)

0    13
1    15
2    46
3    64
4    35
Name: age, dtype: int64

In [121]:
df['job'] = ['teacher','driver','doctor','cook','enginer']
df

  Unnamed: 0 first_name last_name  age     city      job
0          a      jason    miller   12  Chicago  teacher
1          b      molly  jacobson   14       SF   driver
2          c       tina       ali   45       LA   doctor
3          d       jake    milner   63   Boston     cook
4          e        amy     cooze   34       NY  enginer

In [122]:
df['age'] = [13,15,46,64,35]
df

  Unnamed: 0 first_name last_name  age     city      job
0          a      jason    miller   13  Chicago  teacher
1          b      molly  jacobson   15       SF   driver
2          c       tina       ali   46       LA   doctor
3          d       jake    milner   64   Boston     cook
4          e        amy     cooze   35       NY  enginer

In [126]:
df['age'] = df['age'].apply(lambda x:x+1)
df

  Unnamed: 0 first_name last_name  age     city      job
0          a      jason    miller   15  Chicago  teacher
1          b      molly  jacobson   17       SF   driver
2          c       tina       ali   48       LA   doctor
3          d       jake    milner   66   Boston     cook
4          e        amy     cooze   37       NY  enginer

In [ ]:
#삭제 명령에서는 axis 가 바뀜 axis = 1 세로 axis = 0 가로 #drop

In [168]:
wages = pd.read_csv('wages.csv')
wages

              earn  height     sex   race  ed  age
0     79571.299011   73.89    male  white  16   49
1     96396.988643   66.23  female  white  16   62
2     48710.666947   63.77  female  white  16   33
3     80478.096153   63.22  female  other  16   95
4     82089.345498   63.08  female  white  17   43
...            ...     ...     ...    ...  ..  ...
1374  30173.380363   71.68    male  white  12   33
1375  24853.519514   61.31  female  white  18   86
1376  13710.671312   63.64  female  white  12   37
1377  95426.014410   71.65    male  white  12   54
1378   9575.461857   68.22    male  white  12   31

[1379 rows x 6 columns]

In [169]:
wages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1379 entries, 0 to 1378
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   earn    1379 non-null   float64
 1   height  1379 non-null   float64
 2   sex     1379 non-null   object
 3   race    1379 non-null   object
 4   ed      1379 non-null   int64
 5   age     1379 non-null   int64
dtypes: float64(2), int64(2), object(2)
memory usage: 64.8+ KB

In [170]:
wages.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [171]:
wages.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [172]:
wages['height'] = wages['height'].apply(lambda x:int(x))
wages.head()

           earn  height     sex   race  ed  age
0  79571.299011      73    male  white  16   49
1  96396.988643      66  female  white  16   62
2  48710.666947      63  female  white  16   33
3  80478.096153      63  female  other  16   95
4  82089.345498      63  female  white  17   43

In [ ]:
###groupby

# => 동일 종류의 데이터 끼리 묶어서 철;..
# => df['칼럼'] + ['칼럼'].연산함수..

In [173]:
wages.groupby('sex')['earn'].mean() #important
#groupby 이용구조
#1. data grouping => wages.groupby('sex')
#2. group별 값을 계산 => ['earn'].mean()

sex
female    24245.647877
male      45993.126922
Name: earn, dtype: float64

In [ ]:
#인종별 평균 교육연수

In [176]:
wages.groupby('race')['ed'].mean()

race
black       13.039683
hispanic    12.987013
other       13.965517
white       13.398431
Name: ed, dtype: float64

In [177]:
wages.groupby('race')['ed'].sum()

race
black        1643
hispanic     1000
other         405
white       15368
Name: ed, dtype: int64

In [3]:
data = {'Team':['Riders','Riders','Devils','Devils','Kings','Giants','Kings',\
               'Kings','Riders','Royals','Royals','Riders'],
       'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],
       'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
       'Points':[876,788,863,673,741,812,756,788,694,721,804,923]}

In [4]:
df = pd.DataFrame(data)
df

NameError: name 'pd' is not defined

In [5]:
df.head()

NameError: name 'df' is not defined

In [6]:
#팀별  점수

In [7]:
df.groupby('Team')['Points'].sum()

NameError: name 'df' is not defined

In [ ]:
#팀별 최고성적순은?

In [ ]:
df.groupby('Team')['Rank'].min()

In [ ]:
df.groupby('Team')['Points'].min()

In [8]:
#연도별 최고 득점..

In [9]:
df.groupby('Year')['Points'].max()

NameError: name 'df' is not defined

In [ ]:
#grouped객체

In [ ]:
grouped = df.groupby('Team')

In [10]:
grouped.get_group('Kings')

NameError: name 'grouped' is not defined

In [ ]:
grouped.get_group('Royals')

In [11]:
grouped.min()

NameError: name 'grouped' is not defined

In [ ]:
grouped.mean()

In [12]:
grouped['Points'].mean()

NameError: name 'grouped' is not defined

In [ ]:
grouped[['Rank','Points']].agg([np.sum,np.mean,np.std])

In [ ]:
#df.groupby('Team')['Points'].mean()
# =>
grouped = df.groupby('Team')
grouped['Points'].agg(np.mean)

In [13]:
grouped = df.groupby('Team')
grouped['Points'].mean()

NameError: name 'df' is not defined

In [14]:
import numpy as np
import pandas as pd


phone = pd.read_csv('phone_data.csv')
phone.head(5)

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [15]:
phone.describe()  #숫자 통계 정보

            index      duration
count  830.000000    830.000000
mean   414.500000    117.804036
std    239.744656    444.129560
min      0.000000      1.000000
25%    207.250000      1.000000
50%    414.500000     24.500000
75%    621.750000     55.000000
max    829.000000  10528.000000

In [16]:
phone.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   index         830 non-null    int64
 1   date          830 non-null    object
 2   duration      830 non-null    float64
 3   item          830 non-null    object
 4   month         830 non-null    object
 5   network       830 non-null    object
 6   network_type  830 non-null    object
dtypes: float64(1), int64(1), object(5)
memory usage: 45.5+ KB

In [17]:
phone.head(5)

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [18]:
phone.tail(3)

     index            date  duration  item    month network network_type
827    827  13/03/15 06:58    34.429  data  2015-03    data         data
828    828  14/03/15 00:13     1.000   sms  2015-03   world        world
829    829  14/03/15 00:16     1.000   sms  2015-03   world        world

In [19]:
#월별 사용시간의 합계..

In [20]:
phone.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [21]:
#시간대별 평균 사용시간

In [22]:
phone.groupby('date')['duration'].mean()

date
01/01/15 06:58     34.429
01/02/15 06:58     34.429
01/02/15 13:33    103.000
01/03/15 06:58     34.429
01/03/15 12:19      9.000
                   ...
31/12/14 13:00      5.000
31/12/14 13:03    358.000
31/12/14 13:49    526.000
31/12/14 23:05      1.000
31/12/14 23:37      1.000
Name: duration, Length: 747, dtype: float64

In [23]:
d = phone['date'][0].split(' ')[1].split(':')[0]
d

'06'

In [24]:
phone['date']

0      15/10/14 06:58
1      15/10/14 06:58
2      15/10/14 14:46
3      15/10/14 14:48
4      15/10/14 17:27
            ...
825    13/03/15 00:38
826    13/03/15 00:39
827    13/03/15 06:58
828    14/03/15 00:13
829    14/03/15 00:16
Name: date, Length: 830, dtype: object

In [25]:
def mon_scrap(x):
    return x.split()[1][:2]

In [26]:
mon_scrap(phone['date'][0])

'06'

In [27]:
phone.date.apply(mon_scrap)

0      06
1      06
2      14
3      14
4      17
       ..
825    00
826    00
827    06
828    00
829    00
Name: date, Length: 830, dtype: object

In [28]:
phone['time'] = phone.date.apply(mon_scrap)
phone.head()

   index            date  duration  item    month   network network_type time
0      0  15/10/14 06:58    34.429  data  2014-11      data         data   06
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile   06
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile   14
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile   14
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile   17

In [29]:
phone.groupby('time')['duration'].mean()

time
00     23.600000
01      1.285714
02     56.600000
06     34.287086
07      3.285714
08    109.555556
09     95.947368
10     75.459459
11    102.953488
12    262.224490
13    151.480769
14     96.071429
15    224.513514
16    221.177778
17    135.350877
18    159.737705
19    196.042553
20    161.147059
21     52.800000
22      2.444444
23     54.947368
Name: duration, dtype: float64

In [45]:
h_duration = phone.groupby('time')['duration'].mean()

In [46]:
h_duration.sort_values(ascending=False)

time
12    262.224490
15    224.513514
16    221.177778
19    196.042553
20    161.147059
18    159.737705
13    151.480769
17    135.350877
08    109.555556
11    102.953488
14     96.071429
09     95.947368
10     75.459459
02     56.600000
23     54.947368
21     52.800000
06     34.287086
00     23.600000
07      3.285714
22      2.444444
01      1.285714
Name: duration, dtype: float64

In [ ]:
#아이템별 평균사용시간..

In [44]:
phone.groupby('item')['duration'].mean()

item
call    237.940722
data     34.429000
sms       1.000000
Name: duration, dtype: float64

In [47]:
#아이템별 사용횟수..?

phone.groupby('item')['date'].count()

item
call    388
data    150
sms     292
Name: date, dtype: int64

In [ ]:
#call의 월별 평균사용시간?

In [62]:
call_phone = phone[phone.item == 'call']
call_phone

,index,date,duration,item,month,network,network_type,time
1,1,15/10/14 06:58,13.0,call,2014-11,Vodafone,mobile,06
2,2,15/10/14 14:46,23.0,call,2014-11,Meteor,mobile,14
3,3,15/10/14 14:48,4.0,call,2014-11,Tesco,mobile,14
4,4,15/10/14 17:27,4.0,call,2014-11,Tesco,mobile,17
5,5,15/10/14 18:55,4.0,call,2014-11,Tesco,mobile,18
...,...,...,...,...,...,...,...,...
807,807,03/03/15 10:12,745.0,call,2015-03,Vodafone,mobile,10
808,808,03/03/15 10:27,57.0,call,2015-03,Vodafone,mobile,10
809,809,03/03/15 14:34,1325.0,call,2015-03,Vodafone,mobile,14
810,810,03/03/15 18:36,768.0,call,2015-03,Three,mobile,18
816,816,04/03/15 12:29,10528.0,call,2015-03,landline,landline,12

In [63]:
call_phone.groupby('month')['duration'].mean()

month
2014-11    238.757009
2014-12    171.658228
2015-01    193.977273
2015-02    215.164179
2015-03    462.276596
Name: duration, dtype: float64

In [ ]:
# 'item'별, 'month'별 이용횟수를 출력..

In [67]:
phone

,index,date,duration,item,month,network,network_type,time
0,0,15/10/14 06:58,34.429,data,2014-11,data,data,06
1,1,15/10/14 06:58,13.000,call,2014-11,Vodafone,mobile,06
2,2,15/10/14 14:46,23.000,call,2014-11,Meteor,mobile,14
3,3,15/10/14 14:48,4.000,call,2014-11,Tesco,mobile,14
4,4,15/10/14 17:27,4.000,call,2014-11,Tesco,mobile,17
...,...,...,...,...,...,...,...,...
825,825,13/03/15 00:38,1.000,sms,2015-03,world,world,00
826,826,13/03/15 00:39,1.000,sms,2015-03,Vodafone,mobile,00
827,827,13/03/15 06:58,34.429,data,2015-03,data,data,06
828,828,14/03/15 00:13,1.000,sms,2015-03,world,world,00
829,829,14/03/15 00:16,1.000,sms,2015-03,world,world,00

In [70]:
multi_phone = phone.groupby(['item','month'])['date'].count() #multi_index:상위레벨,하위레벨
multi_phone

item  month
call  2014-11    107
      2014-12     79
      2015-01     88
      2015-02     67
      2015-03     47
data  2014-11     29
      2014-12     30
      2015-01     31
      2015-02     31
      2015-03     29
sms   2014-11     94
      2014-12     48
      2015-01     86
      2015-02     39
      2015-03     25
Name: date, dtype: int64

In [ ]:
# multi_index => level을 낮출 수 있음 => unstack() => 하위 인덱스가 column => table

In [71]:
multi_phone.unstack()

month  2014-11  2014-12  2015-01  2015-02  2015-03
item
call       107       79       88       67       47
data        29       30       31       31       29
sms         94       48       86       39       25

In [75]:
#groupby 객체화해서 사용

In [92]:
grouped = phone.groupby('month')

In [93]:
grouped.get_group('2015-02')

,index,date,duration,item,month,network,network_type,time
577,577,13/01/15 06:58,34.429,data,2015-02,data,data,06
586,586,14/01/15 06:58,34.429,data,2015-02,data,data,06
594,594,15/01/15 06:58,34.429,data,2015-02,data,data,06
595,595,15/01/15 10:36,28.000,call,2015-02,Three,mobile,10
596,596,15/01/15 12:23,1.000,sms,2015-02,special,special,12
...,...,...,...,...,...,...,...,...
724,724,10/02/15 00:24,1.000,sms,2015-02,Vodafone,mobile,00
725,725,10/02/15 06:58,34.429,data,2015-02,data,data,06
726,726,10/02/15 21:40,1.000,sms,2015-02,Vodafone,mobile,21
727,727,11/02/15 06:58,34.429,data,2015-02,data,data,06
728,728,12/02/15 06:58,34.429,data,2015-02,data,data,06

In [94]:
grouped.agg(sum)

          index   duration
month
2014-11   26337  26639.441
2014-12   48362  14641.870
2015-01  100259  18223.299
2015-02   90398  15522.299
2015-03   78679  22750.441

In [83]:
grouped.agg({'duration': sum})

          duration
month
2014-11  26639.441
2014-12  14641.870
2015-01  18223.299
2015-02  15522.299
2015-03  22750.441

In [85]:
grouped.agg({'duration':sum,'network_type':'count','date':'first'})

          duration  network_type            date
month
2014-11  26639.441           230  15/10/14 06:58
2014-12  14641.870           157  13/11/14 06:58
2015-01  18223.299           205  13/12/14 06:58
2015-02  15522.299           137  13/01/15 06:58
2015-03  22750.441           101  12/02/15 20:15

In [86]:
grouped = phone.groupby(['month','item'])

In [87]:
grouped.agg({'duration':sum,'network_type':'count','date':'first'})

               duration  network_type            date
month   item
2014-11 call  25547.000           107  15/10/14 06:58
        data    998.441            29  15/10/14 06:58
        sms      94.000            94  16/10/14 22:18
2014-12 call  13561.000            79  14/11/14 17:24
        data   1032.870            30  13/11/14 06:58
        sms      48.000            48  14/11/14 17:28
2015-01 call  17070.000            88  15/12/14 20:03
        data   1067.299            31  13/12/14 06:58
        sms      86.000            86  15/12/14 19:56
2015-02 call  14416.000            67  15/01/15 10:36
        data   1067.299            31  13/01/15 06:58
        sms      39.000            39  15/01/15 12:23
2015-03 call  21727.000            47  12/02/15 20:15
        data    998.441            29  13/02/15 06:58
        sms      25.000            25  19/02/15 18:46

In [88]:
grouped.agg({'duration':[min,max,sum],'network_type':'count','date':[min,'first','unique']})

             duration                       network_type            date  \
                  min        max        sum        count             min
month   item
2014-11 call    1.000   1940.000  25547.000          107  01/11/14 15:13
        data   34.429     34.429    998.441           29  01/11/14 06:58
        sms     1.000      1.000     94.000           94  03/11/14 08:40
2014-12 call    2.000   2120.000  13561.000           79  02/12/14 11:40
        data   34.429     34.429   1032.870           30  01/12/14 06:58
        sms     1.000      1.000     48.000           48  01/12/14 12:51
2015-01 call    2.000   1859.000  17070.000           88  02/01/15 11:27
        data   34.429     34.429   1067.299           31  01/01/15 06:58
        sms     1.000      1.000     86.000           86  02/01/15 23:26
2015-02 call    1.000   1863.000  14416.000           67  01/02/15 13:33
        data   34.429     34.429   1067.299           31  01/02/15 06:58
        sms     1.000      1.000     39.000           39  02/02/15 17:35
2015-03 call    2.000  10528.000  21727.000           47  01/03/15 12:19
        data   34.429     34.429    998.441           29  01/03/15 06:58
        sms     1.000      1.000     25.000           25  02/03/15 09:19

                              \
                       first
month   item
2014-11 call  15/10/14 06:58
        data  15/10/14 06:58
        sms   16/10/14 22:18
2014-12 call  14/11/14 17:24
        data  13/11/14 06:58
        sms   14/11/14 17:28
2015-01 call  15/12/14 20:03
        data  13/12/14 06:58
        sms   15/12/14 19:56
2015-02 call  15/01/15 10:36
        data  13/01/15 06:58
        sms   15/01/15 12:23
2015-03 call  12/02/15 20:15
        data  13/02/15 06:58
        sms   19/02/15 18:46


                                                         unique
month   item
2014-11 call  [15/10/14 06:58, 15/10/14 14:46, 15/10/14 14:4...
        data  [15/10/14 06:58, 16/10/14 06:58, 17/10/14 06:5...
        sms   [16/10/14 22:18, 16/10/14 22:21, 17/10/14 10:5...
2014-12 call  [14/11/14 17:24, 16/11/14 14:05, 19/11/14 14:0...
        data  [13/11/14 06:58, 14/11/14 06:58, 15/11/14 06:5...
        sms   [14/11/14 17:28, 18/11/14 08:22, 18/11/14 08:2...
2015-01 call  [15/12/14 20:03, 17/12/14 18:08, 18/12/14 12:3...
        data  [13/12/14 06:58, 14/12/14 06:58, 15/12/14 06:5...
        sms   [15/12/14 19:56, 15/12/14 19:58, 15/12/14 20:1...
2015-02 call  [15/01/15 10:36, 15/01/15 17:22, 16/01/15 09:4...
        data  [13/01/15 06:58, 14/01/15 06:58, 15/01/15 06:5...
        sms   [15/01/15 12:23, 16/01/15 18:07, 19/01/15 12:4...
2015-03 call  [12/02/15 20:15, 12/02/15 20:51, 13/02/15 10:5...
        data  [13/02/15 06:58, 14/02/15 06:58, 15/02/15 06:5...
        sms   [19/02/15 18:46, 19/02/15 22:00, 24/02/15 13:3...